Postgres/dist-storage/Test-HDP-10-5-summary.csv
Label,# Samples,Average, Min ,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes,,
Query 15,50,4141," 1,740.00 ",10000,1333.65,0.00%,1.85549,3.37,0,1860," 4,945.00 ", 1.84 
query 17,50,18376," 4,375.00 ",24456,3724.02,0.00%,0.48824,0.16,0,346," 9,016.00 ", 1.06 
Query 26,50,2857," 1,125.00 ",11123,2169.09,0.00%,2.44403,0.07,0,30," 2,340.00 ", 1.08 
Oracle 28,50,34074," 6,879.00 ",62092,6898.96,0.00%,0.27605,0.08,0,308," 237,028.00 ", 33.46 
query 30,50,2324," 1,371.00 ",7498,1343.24,0.00%,2.788,0.99,0,362,, (1.00)
query 45,50,2020," 1,279.00 ",2913,311.18,0.00%,2.56003,0.06,0,24,, (1.00)
TOTAL,300,10632," 16,769.00 ",62092,12417.13,0.00%,0.81432,0.39,0,488.3,,