Postgres/dist-storage/Test-dremio-10-5-summary.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
Query 15,50,31338,4945,106135,20010.82,0.000%,.24143,0.44,0.00,1860.0
query 17,50,56834,9016,122930,24228.20,0.000%,.16042,0.05,0.00,346.0
Query 26,50,20821,2340,91245,23063.39,0.000%,.30479,0.01,0.00,30.0
Oracle 28,50,204806,2349,642267,122022.54,60.000%,.04723,0.18,0.00,3799.6
query 30,50,9481,3893,63518,8369.03,0.000%,.62436,0.22,0.00,362.0
query 45,50,44768,42217,50657,1772.86,0.000%,.21831,0.01,0.00,24.0
TOTAL,300,61341,2340,642267,84252.47,10.000%,.14629,0.15,0.00,1070.3